In [1]:
import pandas as pd
import numpy as np

In [13]:
df=pd.DataFrame({'Name':['NK','PK','DK','MK'],'Maths':[98,85,74,85]})

In [3]:
df

  Name  Maths
0   NK     98
1   PK     85
2   DK     74
3   MK     85

In [5]:
comp={'NK':100,'PK':87,'DK':78,'MK':84}

In [14]:
df['comp']=df['Name'].map(comp)

In [15]:
df

  Name  Maths  comp
0   NK     98   100
1   PK     85    87
2   DK     74    78
3   MK     85    84